const difficutmLevelSize = new Map();
difficutmLevelSize
  .set("Очень сложно-0", "30-60-120150-36")
  .set("Очень сложно-1", "40-70-165-200-4-7")
  .set("Очень сложно-2", "60-90-225-250-5-8")
  .set("Очень сложно-3", "90-120-330-375-6-9")
  .set("Очень сложно-4", "120-150-400-450-10-12")
  .set("Сложно-0", "60-90-120-150-7-10")
  .set("Сложно-1", "70-100-165-200-7-10")
  .set("Сложно-2", "90-120-210-250-8-12")
  .set("Сложно-3", "120-150-330-375-10-15")
  .set("Сложно-4", "150-180-400-450-12-18")
  .set("Норм-0", "90-120-100-150-11-15")
  .set("Норм-1", "100-120-145-165-11-15")
  .set("Норм-2", "120-150-200-220-12-18")
  .set("Норм-3", "150-180-280-330-15-20")
  .set("Норм-4", "180-210-360-400-18-25")
  .set("Легко-0", "120-150-90-120-14-20")
  .set("Легко-1", "120-150-110-145-10-20")
  .set("Легко-2", "150-210-180-200-18-25")
  .set("Легко-3", "180-210-210-280-20-25")
  .set("Легко-4", "210-240-300-360-25-35")
  .set("Очень легко-0", "150-300-50-90-25-50")
  .set("Очень легко-1", "150-300-50-110-25-50")
  .set("Очень легко-2", "210-300-50-180-25-50")
  .set("Очень легко-3", "210-300-50-210-25-50")
  .set("Очень легко-4", "240-300-60-300-35-50");

const getOptionsParam = (
  size: number,
  difficult: string,
  difficutmLevelSize: Map<string, string>
) => {
  const params = difficutmLevelSize.get(difficult + "-" + size)?.split("-");
  return {
    timeMin: params?.[0] ? params?.[0] : "30",
    timeMax: params?.[1] ? params?.[1] : "300",
    pointsMin: params?.[2] ? params?.[2] : "50",
    pointsMax: params?.[3] ? params?.[3] : "450",
    mistakeMin: params?.[4] ? params?.[4] : "3",
    mistakeMax: params?.[5] ? params?.[5] : "50",
  };
};

export { getOptionsParam, difficutmLevelSize };
